print("some", "text", "in python", sep=" * ")
print("new text")
print("test", "new", "text", end="*")
print("next line")
print("next line")

number = 100
print("Number:", number)
print(f"Number: {number + 10}")

print(f"\t\t\t\t\t\tLorem Ipsum\nis simply dummy text of the printing and typesetting industry.\n"
      f"Lorem Ipsum has been the industry's standard dummy text ever since the 1500s,\n"
      f"when an unknown printer took a galley of type and scrambled it to make a type specimen book.")

# operators +  -  /   *   **  //  %

print(2 + 4)
print(10 - 4)
print(2 * 6)
print(4 / 2)
print(-10)
# print(5/0)  ZeroDivisionError: division by zero

print(2 ** 3)
print(3 ** 3)

print(10 // 2)
print(10 // 3)
print(10 / 3)

print(10 % 3)
print(10 % 2)

print(22 % 7)

# number = 2 + (4 * 2) ** 3
# print(f"Num: {number}")
# # int()  float()  str()
# product_price = int(input("Enter product price - "))
# desc = float(input("Enter amount of discount -"))
# print(type(product_price))
# print(f"Your price is: {product_price} $")
# price_with_desc = product_price * (1-desc / 100)
# print(f"Price with desc: {price_with_desc} $")

print(int("100") * 2)

print(str(100.8))

#
# Завдання 1
# Користувач вводить з клавіатури два числа. Необхідно знайти суму чисел, різницю чисел, добуток числі. Результат обчислень вивести на екран.

number1 = int(input("Enter num1 - "))
number2 = int(input("Enter num2 - "))
print(f"Sum: {number1} + {number2} = {number1 + number2}")

# Завдання 2
# Користувач вводить із клавіатури два числа. Перше число — це значення, друге число відсоток, який необхідно порахувати.
# Наприклад, ми ввели з клавіатури 50 і 10. Потрібно вивести на екран 10 відсотків від 50. Результат: 5.


# Завдання 3
# Напишіть програму, що обчислює площу прямокутника. Користувач з клавіатури вводить ширину і висоту прямокутника.

# Завдання 4
# Користувач вводить з клавіатури довжину сторони квадрата. Напишіть програму, яка обчислює і виводить на екран периметр квадрата за формулою:
# P = 4 х a
# де a — довжина сторони квадрата.

n3 = int(input("Enter number: "))
disc = int(input("Enter ur disc: "))
print(f"Відсоток від вашого числа: {(n3 * disc) / 100}")


# Завдання 1
# Користувач вводить з клавіатури кількість метрів. Потрібно вивести результат переведення метрів у сантиметри, дециметри, міліметри, милі.


# Завдання 2
# Напишіть програму, що обчислює площу ромба. Користувач з клавіатури вводить довжину двох його діагоналей.
#
# Завдання 3
# Користувач вводить з клавіатури три числа. Перше число - зарплата за місяць, друге число — сума місячного платежу за кредитом у банку,
# третє число — заборгованість за комунальні послуги. Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.
#
# Завдання 4
# Напишіть програму, яка обчислює вартість поїздки на автомобілі. Користувач вводить відстань у кілометрах, витрату палива на 100 кілометрів
# і ціну за літр бензину. Програма повинна вивести підсумкову вартість поїздки.
#
# Завдання 5
# Користувач вводить з клавіатури три цифри. Необхідно створити число, що містить ці цифри. Наприклад, якщо з клавіатури введено 1, 5, 7, тоді потрібно сформувати число 157.
#
# Завдання 6
# Користувач вводить із клавіатури число, що складається з чотирьох цифр. Потрібно знайти добуток цифр. Наприклад, якщо з клавіатури введено 1324, тоді результат добутку 1*3*2*4 = 24.
#
# Завдання 7*
# Користувач вводить вартість оренди автомобіля за день, кількість днів оренди та суму застави, яку потрібно внести.
# Напишіть програму, яка розраховує загальну вартість оренди (з урахуванням застави) і виводить суму, яку необхідно
# заплатити користувачеві після повернення автомобіля (припускаючи, що застава повертається повністю).
# Програма повинна також розділити підсумкову суму оренди (без застави) на кількість днів і вивести вартість оренди за один день.